АлогистикТест2/src/Documents/алк_ТранспортировкаЗапасов/алк_ТранспортировкаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ТранспортировкаЗапасов</name>
  <basedOn>Document.алк_РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОтгрузкиПоЗаказам</registerRecords>
  <registerRecords>AccumulationRegister.алк_ТоварыВПути</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.алк_ОтгрузкаРН</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическийЦентрОтправитель</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическийЦентрПолучатель</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаОтправитель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктОтправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.алк_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспорта</name>
    <type>
      <types>EnumRef.алк_ВидыТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Пломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОнЖе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемТаможняДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоподъемность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетОснованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоответствуетОснованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВ_ТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Мультизаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКУчету_ТД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопАналитика</name>
    <type>
      <types>CatalogRef.алк_АналитикаРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаИДКонтейнеров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБруттоПриВзвешивании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБруттоПриВзвешиванииВПорту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПорученияЭкспедитору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесКонтейнера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриемкаВПорту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемкаВПортуДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Задекларирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНеттоПриВзвешивании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьИдентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.алк_Аддендумы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоПорт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоПорт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизит</name>
    <attributes>
      <name>УпакРеквизит</name>
      <type>
        <types>CatalogRef.алк_Реквизит</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесРеквизита</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.алк_РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьЗаказ</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ВидыТранспортировки/алк_ВидыТранспортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыТранспортировки</name>
  <enumValues>
    <name>Автомобильная</name>
  </enumValues>
  <enumValues>
    <name>Железнодорожная</name>
  </enumValues>
  <enumValues>
    <name>Теплоход</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/алк_Участки/алк_Участки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_Участки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДополнительнаяОперация</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяАддендумы</name>
    <comment>Используются аддендумы, вместо ЗаказПокупателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРабочее</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураВыпуска</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураСписания</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВОтчете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладВыпуска</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСписания</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.алк_Цеха</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДвиженияПроизводства</name>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.алк_ВидыДвиженияПроизводствоОборот</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Целевая</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ТранспортировкаЗапасов/Forms/ФормаСписка/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПараметрыСеанса.алк_СеансПортовогоАгента Тогда
		Отказ = Истина;	
	КонецЕсли; 
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	Если Параметры.Свойство("ОтборПоВидТранспортировки_Авто") Тогда
		
		Заголовок = "Документы транспортировки: Автомобильные";
		АвтоЗаголовок = Ложь;
		
		ОтобратьПоВидуТранспортировкиНаСервере(Перечисления.алк_ВидыТранспортировки.Автомобильная);	
		
	ИначеЕсли Параметры.Свойство("ОтборПоВидТранспортировки_ЖД") Тогда 
		
		Заголовок = "Документы транспортировки: Железнодорожные";
		АвтоЗаголовок = Ложь;
		
		ОтобратьПоВидуТранспортировкиНаСервере(Перечисления.алк_ВидыТранспортировки.Железнодорожная);	
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//УстановитьОтборПоНаправлению();
	
	Для Каждого участок ИЗ ВернутьУчастки() Цикл
		Элементы.ОтборУчасток.СписокВыбора.Добавить(участок.Ссылка);
	КонецЦикла; 
	
	ОтборУчастокУстановлен = (ОтборУчасток.Количество() <> 0); 
	
	Если ОтборУчастокУстановлен Тогда
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Участок", ОтборУчасток, ОтборУчастокУстановлен);
	КонецЕсли;
	
	ОтборВидТранспортировкиУстановлен = (ОтборПоВидуТранспортировки.Количество() <> 0); 
	
	Если ОтборВидТранспортировкиУстановлен Тогда
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ВидТранспортировки", ОтборПоВидуТранспортировки, ОтборВидТранспортировкиУстановлен);
	КонецЕсли;
	
	ОтборИдТСУстановлен = ЗначениеЗаполнено(ОтборИдентификаторТС); 
	
	Если ОтборИдТСУстановлен Тогда
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ИдентификаторТС", ОтборИдентификаторТС, ОтборИдТСУстановлен);
	КонецЕсли;
	
	ОтборНоменклатураУстановлен = (ОтборНоменклатура.Количество() <> 0);
	
	Если НЕ ОтборНоменклатураУстановлен Тогда 
		Возврат;
	КонецЕсли; 
			
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Запасы.Номенклатура", ОтборНоменклатура, ОтборНоменклатураУстановлен);
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОтборНаправлениеПриИзменении(Элемент)
	
	УстановитьОтборПоНаправлению();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборУчастокПриИзменении(Элемент)
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Участок", ОтборУчасток, ОтборУчасток.Количество() <> 0);
КонецПроцедуры

&НаКлиенте
Процедура ОтборУчастокОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	МассивОтбора = Новый Массив; 
	Для Каждого эл ИЗ ОтборУчасток Цикл
		МассивОтбора.Добавить(эл.Значение);
	КонецЦикла;   
	МассивОтбора.Добавить(ВыбранноеЗначение);
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Участок", МассивОтбора, МассивОтбора.Количество() <> 0);
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураПриИзменении(Элемент)	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Запасы.Номенклатура", ОтборНоменклатура, ОтборНоменклатура.Количество() <> 0);	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИдентификаторТСПриИзменении(Элемент)
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ИдентификаторТС", ОтборИдентификаторТС, ЗначениеЗаполнено(ОтборИдентификаторТС));
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка) 
	МассивОтбора = Новый Массив; 
	Для Каждого эл ИЗ ОтборНоменклатура Цикл
		МассивОтбора.Добавить(эл.Значение);
	КонецЦикла;   
	МассивОтбора.Добавить(ВыбранноеЗначение);  
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Запасы.Номенклатура", МассивОтбора, МассивОтбора.Количество() <> 0);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВидуТранспортировкиПриИзменении(Элемент) 
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ВидТранспортировки", ОтборПоВидуТранспортировки, ОтборПоВидуТранспортировки.Количество() <> 0);	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВидуТранспортировкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	МассивОтбора = Новый Массив; 
	Для Каждого эл ИЗ ОтборПоВидуТранспортировки Цикл
		МассивОтбора.Добавить(эл.Значение);
	КонецЦикла;   
	МассивОтбора.Добавить(ВыбранноеЗначение);
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ВидТранспортировки", МассивОтбора, МассивОтбора.Количество() <> 0);
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытий

//так как направления больше не заполняются, меняем на участки 20240916
&НаСервере
Процедура УстановитьОтборПоНаправлению()
	
	МассивОтбора = Новый Массив;
	Если ОтборНаправлениеЛесопиление Тогда
		МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000040")); //СГП ПМ
	КонецЕсли;
	
	//Если ОтборНаправлениеОтходы Тогда
	//	МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду(""));
	//КонецЕсли;
	
	Если ОтборНаправлениеГранулы Тогда
		МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000039")); //СГП ДГ
	КонецЕсли;
	
	Если ОтборНаправлениеШпон Тогда
		МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000038")); //СГП Шпон
		МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000043")); //СГП Шпон (Сборка/разборка)
	КонецЕсли;
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Участок", МассивОтбора, ЗначениеЗаполнено(МассивОтбора));
	
КонецПроцедуры //УстановитьОтборПоНаправлению()

#КонецОбласти


#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры


// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 


#Область СлужебныеПиФ

&НаСервере
Процедура ОтобратьПоВидуТранспортировкиНаСервере(ВидТранспортировки)
	
	ОтборПоВидуТранспортировки = Список.КомпоновщикНастроек.Настройки.Отбор;
	
	ОтборВПользовательскихНастройках = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
	ОтборПоВидуТранспортировки.ИдентификаторПользовательскойНастройки);
	
	РаботаемСНастройками = Истина;																		
	Если ОтборВПользовательскихНастройках <> Неопределено Тогда
		
		РаботаемСНастройками = Ложь;
		ОтборПоВидуТранспортировки = ОтборВПользовательскихНастройках;		
		
	КонецЕсли;																		
	
	ОтборПоВидуТранспортировки = Неопределено;
	ПолеВидТранспортировки = Новый ПолеКомпоновкиДанных("ВидТранспортировки");
	
	Для каждого ЭлементОтбора Из ОтборПоВидуТранспортировки.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			и ЭлементОтбора.ЛевоеЗначение = ПолеВидТранспортировки Тогда
			
			ОтборПоВидуТранспортировки = ЭлементОтбора;
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если ОтборПоВидуТранспортировки = Неопределено Тогда
		
		ОтборПоВидуТранспортировки = ОтборПоВидуТранспортировки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоВидуТранспортировки.ЛевоеЗначение = ПолеВидТранспортировки;
		ОтборПоВидуТранспортировки.Использование = Ложь;
		//ОтборПоВидуТранспортировки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ОтборПоВидуТранспортировки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ОтборПоВидуТранспортировки.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		Элементы.Список.СоздатьЭлементыФормыПользовательскихНастроек();
		
	КонецЕсли;
	
	Если РаботаемСНастройками Тогда
		
		ОтборПоВидуТранспортировки = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ОтборПоВидуТранспортировки.ИдентификаторПользовательскойНастройки);
		
	КонецЕсли;
	ОтборПоВидуТранспортировки.Использование = Не ОтборПоВидуТранспортировки.Использование;
	
	ОтборПоВидуТранспортировки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоВидуТранспортировки.ПравоеЗначение = ВидТранспортировки;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеФ 

&НаСервереБезКонтекста
Функция ВернутьУчастки()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	алк_Участки.Ссылка
	               |ИЗ
	               |	Справочник.алк_Участки КАК алк_Участки
	               |ГДЕ
	               |	алк_Участки.Цех.Код В (""000000005"", ""000000004"")
	               |	И НЕ алк_Участки.ЭтоГруппа";
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
КонецФункции

#КонецОбласти


Процедура Конец()		
КонецПроцедуры
